import task1.TaskOne;
import task3.TaskThree;
import task2.TaskTwo;

public class Main {

    public static void main(String[] args) {
        System.out.println("-------------------------------------------------------------------------------------------------------");
        System.out.println("Задание №1:\n Есть список поездов, представленный в виде XML. Вывести на экран информацию о тех поездах, которые\n" +
                "отправляются сегодня с 15:00 до 19:00.\n" +
                " Написать код для добавления новых поездов в существующий XML.\n");
        System.out.println("*******************************************************************************************************");
        TaskOne.start();
        System.out.println("*******************************************************************************************************\n");

        System.out.println("-------------------------------------------------------------------------------------------------------");
        System.out.println("Задание №2:\n Распарсить следующую структуру данных:\n");
        TaskTwo.start();

        System.out.println("-------------------------------------------------------------------------------------------------------\n");
        System.out.println("Задание №3: \n Написать парсер для Yahoo Finance в\n" +
                "режиме XML (format=xml).");
        TaskThree.start();
        System.out.println("-------------------------------------------------------------------------------------------------------\n");
    }
}
